; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   red_block_1 purple_block_1 grey_block_1 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (hold_1) (hold_2))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (not (and (clear purple_block_1) (not (= ?obj purple_block_1)))) (hold_0)) (when (and (not (and (clear purple_block_1) (not (= ?obj purple_block_1)))) (not (or (= ?obj red_block_1) (holding red_block_1)))) (not (hold_1))) (when (or (= ?obj red_block_1) (holding red_block_1)) (hold_1)) (when (or (= ?obj grey_block_1) (holding grey_block_1)) (hold_2)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (not (or (= ?obj purple_block_1) (clear purple_block_1))) (hold_0)) (when (and (not (or (= ?obj purple_block_1) (clear purple_block_1))) (not (and (holding red_block_1) (not (= ?obj red_block_1))))) (not (hold_1))) (when (and (holding red_block_1) (not (= ?obj red_block_1))) (hold_1)) (when (and (holding grey_block_1) (not (= ?obj grey_block_1))) (hold_2)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (not (or (= ?obj purple_block_1) (and (clear purple_block_1) (not (= ?underobj purple_block_1))))) (hold_0)) (when (and (not (or (= ?obj purple_block_1) (and (clear purple_block_1) (not (= ?underobj purple_block_1))))) (not (and (holding red_block_1) (not (= ?obj red_block_1))))) (not (hold_1))) (when (and (holding red_block_1) (not (= ?obj red_block_1))) (hold_1)) (when (and (holding grey_block_1) (not (= ?obj grey_block_1))) (hold_2)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (not (or (= ?underobj purple_block_1) (and (clear purple_block_1) (not (= ?obj purple_block_1))))) (hold_0)) (when (and (not (or (= ?underobj purple_block_1) (and (clear purple_block_1) (not (= ?obj purple_block_1))))) (not (or (= ?obj red_block_1) (holding red_block_1)))) (not (hold_1))) (when (or (= ?obj red_block_1) (holding red_block_1)) (hold_1)) (when (or (= ?obj grey_block_1) (holding grey_block_1)) (hold_2)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
   yellow_block_1 yellow_block_2 - block
 )
 (:init (ontable red_block_1) (ontable yellow_block_1) (ontable yellow_block_2) (on purple_block_1 red_block_1) (ontable grey_block_1) (clear yellow_block_1) (clear yellow_block_2) (clear purple_block_1) (clear grey_block_1) (handempty) (hold_1) (= (total-cost) 0))
 (:goal (and (on yellow_block_2 purple_block_1) (hold_0) (hold_1) (hold_2)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack purple_block_1 red_block_1)
   deleted: (on purple_block_1 red_block_1) (clear purple_block_1) (handempty) (hold_1)
   added: (holding purple_block_1) (clear red_block_1) (hold_0)
   goals met: 1 of 4
2. (putdown purple_block_1)
   deleted: (holding purple_block_1)
   added: (clear purple_block_1) (handempty) (ontable purple_block_1)
   goals met: 1 of 4
3. (pickup yellow_block_2)
   deleted: (clear yellow_block_2) (ontable yellow_block_2) (handempty)
   added: (holding yellow_block_2)
   goals met: 1 of 4
4. (stack yellow_block_2 purple_block_1)
   deleted: (clear purple_block_1) (holding yellow_block_2)
   added: (handempty) (clear yellow_block_2) (on yellow_block_2 purple_block_1)
   goals met: 2 of 4
5. (pickup grey_block_1)
   deleted: (clear grey_block_1) (ontable grey_block_1) (handempty)
   added: (holding grey_block_1) (hold_2)
   goals met: 3 of 4
6. (putdown grey_block_1)
   deleted: (holding grey_block_1)
   added: (clear grey_block_1) (handempty) (ontable grey_block_1)
   goals met: 3 of 4
7. (pickup red_block_1)
   deleted: (clear red_block_1) (ontable red_block_1) (handempty)
   added: (holding red_block_1) (hold_1)
   goals met: 4 of 4
